[Killed] MethodExpression
main/components/Sections/SectionsOverTimeTable.js:45:38
       Aggregated: ({ cell: { value } }) => `${value}`,
 
       // Stryker disable next-line ArrowFunction: factor out and test the arrow function separately
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: ({ cell: { value } }) => value,
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  CMPSC 130A -1
Received:
  CMPSC 130A -1

[Killed] ArithmeticOperator
main/components/Sections/SectionsOverTimeTable.js:45:57
       Aggregated: ({ cell: { value } }) => `${value}`,
 
       // Stryker disable next-line ArrowFunction: factor out and test the arrow function separately
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: ({ cell: { value } }) => value.substring(0, value.length + 2),
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  CMPSC 130A -1
Received:
  CMPSC 130A -1
