[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:19:5
 
   // purge job log API call
   const purgeJobLogMutation = useBackendMutation(
-    () => ({
-      url: "/api/jobs/all",
-      method: "DELETE",
-    }),
+    () => undefined,
     {},
     ["/api/jobs/all"], // invalidate the cache key for jobs list
killedBy: AdminJobsPage tests clicking the Purge Job Log button triggers DELETE /api/jobs/all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:27:35
     ["/api/jobs/all"], // invalidate the cache key for jobs list
   );
 
-  const handlePurgeJobLog = () => {
-    purgeJobLogMutation.mutate();
-  };
+  const handlePurgeJobLog = () => {};
 
   // test job
killedBy: AdminJobsPage tests clicking the Purge Job Log button triggers DELETE /api/jobs/all
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:50:58
 
   // ***** update courses job *******
 
-  const objectToAxiosParamsUpdateCoursesJob = (data) => ({
-    url: `/api/jobs/launch/updateCourses?quarterYYYYQ=${data.quarter}&subjectArea=${data.subject}&ifStale=${data.ifStale}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesJob = (data) => ({});
 
   const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:62:13
 
   const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
     url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.startQuarter}&end_quarterYYYYQ=${data.endQuarter}&ifStale=${data.ifStale}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:152:5
         />
       ),
     },
-    {
-      name: "Update Grade Info",
-      form: <UpdateGradeInfoForm callback={submitUpdateGradeInfoJob} />,
-    },
+    {},
   ];
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update Grade Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
