[Killed] StringLiteral
main/components/Updates/UpdatesTable.js:26:15
       accessor: "saved",
     },
     {
-      Header: "Updated",
+      Header: "",
       accessor: "updated",
     },
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Updated. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Updates/UpdatesTable.js:30:15
       accessor: "updated",
     },
     {
-      Header: "Errors",
+      Header: "",
       accessor: "errors",
     },
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Errors. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
