[Killed] BlockStatement
main/components/Updates/UpdatesTable.js:18:34
         {
             Header: "Quarter",
             accessor: "quarter",
-            Cell: ({ value }) => {
-                return yyyyqToQyy(value);
-            },
+            Cell: ({ value }) => {},
         },
         {
killedBy: UpdatesTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W21
Received:

[Killed] ObjectLiteral
main/components/Updates/UpdatesTable.js:22:9
                 return yyyyqToQyy(value);
             },
         },
-        {
-            Header: "Saved",
-            accessor: "saved",
-        },
+        {},
         {
             Header: "Updated",
killedBy: UpdatesTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
