[Killed] BlockStatement
main/components/Sections/SectionsTable.js:57:61
 
   return false;
 }
-export function isLectureWithSections(enrollCode, sections) {
-  // Find the section with the given enrollCode
-  const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
-  );
-
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
-
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
-  }
-
-  return false;
-}
+export function isLectureWithSections(enrollCode, sections) {}
 
 export const objectToAxiosParams = (data) => {
killedBy: isLectureWithSections should return false when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:63:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
-
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:68:36
     const courseId = section.courseInfo.courseId;
     const sectionNumberEnd = section.section.section.slice(2);
 
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
+    if (sectionNumberEnd === "00") {}
   }
 
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:235:15
       Aggregated: renderInfoLink,
     },
     {
-      Header: "Action",
+      Header: "",
       id: "action",
       accessor: "section.enrollCode",
killedBy: Section tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Action. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      role="table"

[Survived] BlockStatement
main/components/Sections/SectionsTable.js:240:26
       accessor: "section.enrollCode",
       disableGroupBy: true,
       // No need for accessor if it's purely for actions like expand/collapse
-      Cell: ({ row }) => {
-        // Stryker disable all : difficult to test modal interaction
-        /* istanbul ignore next : difficult to test modal interaction*/
-        if (isSection(row.original.section.section) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={row.original}
-                quarter={row.original.courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else {
-          return null;
-        }
-      },
+      Cell: ({ row }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value }, row }) => /* istanbul ignore next */ {
