[Killed] BlockStatement
main/components/Sections/SectionsTable.js:31:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumber = section.section.section;
-    const courseSections = sections.filter(
-      (section) => section.courseInfo.courseId === courseId,
-    );
-    const timeLocations = section.section.timeLocations;
-
-    // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
-      // Check if the section has a location to make sure its a course
-      return (
-        courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
-        timeLocations.length === 1
-      );
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:41:35
     const timeLocations = section.section.timeLocations;
 
     // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
+    if (sectionNumber === "0100") {} else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
main/components/Sections/SectionsTable.js:44:14
     if (sectionNumber === "0100") {
       // Filter all sections with the same courseId
       // Check if there is only one section for the course
-      return courseSections.length === 1;
+      return courseSections.length !== 1;
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:45:50
       // Filter all sections with the same courseId
       // Check if there is only one section for the course
       return courseSections.length === 1;
-    } else if (sectionNumber.slice(-2) === "00") {
-      // Check if the section has a location to make sure its a course
-      return (
-        courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
-        timeLocations.length === 1
-      );
-    }
+    } else if (sectionNumber.slice(-2) === "00") {}
   }
 
killedBy: isLectureWithNoSections should return true when the section number ends in 00 and is not 0100 and has a location
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
main/components/Sections/SectionsTable.js:48:9
     } else if (sectionNumber.slice(-2) === "00") {
       // Check if the section has a location to make sure its a course
       return (
-        courseSections.length === 1 &&
-        typeof timeLocations !== "undefined" &&
+        courseSections.length === 1 || typeof timeLocations !== "undefined" &&
         timeLocations.length === 1
       );
killedBy: isLectureWithNoSections should return false when the section number ends in 00 and is not 0100 and does not have a location
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:57:61
 
   return false;
 }
-export function isLectureWithSections(enrollCode, sections) {
-  // Find the section with the given enrollCode
-  const section = sections.find(
-    (section) => section.section.enrollCode === enrollCode,
-  );
-
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
-
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
-  }
-
-  return false;
-}
+export function isLectureWithSections(enrollCode, sections) {}
 
 export const objectToAxiosParams = (data) => {
killedBy: isLectureWithSections should return false when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:63:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumberEnd = section.section.section.slice(2);
-
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:68:36
     const courseId = section.courseInfo.courseId;
     const sectionNumberEnd = section.section.section.slice(2);
 
-    if (sectionNumberEnd === "00") {
-      // Filter all sections with the same courseId
-
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Check if there is only one section for the course
-      return courseSections.length > 1;
-    }
+    if (sectionNumberEnd === "00") {}
   }
 
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:68:9
     const courseId = section.courseInfo.courseId;
     const sectionNumberEnd = section.section.section.slice(2);
 
-    if (sectionNumberEnd === "00") {
+    if (false) {
       // Filter all sections with the same courseId
 
killedBy: isLectureWithSections should return true when the section is a lecture but there are other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
main/components/Sections/SectionsTable.js:71:30
     if (sectionNumberEnd === "00") {
       // Filter all sections with the same courseId
 
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
+      const courseSections = sections;
       // Check if there is only one section for the course
       return courseSections.length > 1;
killedBy: isLectureWithSections does not include unrelated sections in the courseSections array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.js:72:22
       // Filter all sections with the same courseId
 
       const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
+        (section) => true,
       );
       // Check if there is only one section for the course
killedBy: isLectureWithSections does not include unrelated sections in the courseSections array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
