[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:77:10
       <div className="pt-2">
         <h1>Edit Personal Schedule</h1>
         {createButton()}
-        {personalSchedule && (
-          <PersonalScheduleForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialPersonalSchedule={personalSchedule}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally returns error message when backend encounters an error
statusReason: Error: Unable to find an element by: [data-testid="PersonalScheduleForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
